[
    {
        "company": "Blue Ocean IT Sdn. Bhd.",
        "position": "Software Engineer Intern",
        "location": {
            "city": "Kuala Lumpur",
            "country": "Malaysia"
        },
        "type": "Internship",
        "periods": [
            {
                "start": {
                    "month": "July",
                    "year": 2024
                },
                "end": {
                    "month": "November",
                    "year": 2024
                }
            }
        ],
        "description": "Software Engineer Internship at Blue Ocean IT, focusing on full-stack development, database management, and improving software engineering practices within an agile environment.",
        "responsibilities": [
            "Designed and implemented responsive, user-friendly interfaces using HTML, CSS, JavaScript, Angular, and Bootstrap, ensuring accessibility and cross-browser compatibility.",
            "Built scalable backend systems and developed RESTful APIs using Django and Python for efficient data handling and secure communication.",
            "Performed complex T-SQL operations, optimized queries, and contributed to scalable database schema design, ensuring data integrity and performance.",
            "Debugged and resolved application issues, conducted root-cause analysis, and enhanced system stability.",
            "Conducted security assessments, addressed vulnerabilities, and implemented robust authentication and authorization mechanisms.",
            "Automated data migration scripts and ensured smooth deployments using CI/CD pipelines and rollback strategies.",
            "Streamlined workflows by developing Python-based automation tools, reducing manual tasks and enhancing productivity.",
            "Collaborated using Git and GitLab, managing version control and ensuring code quality through pull requests and merge conflict resolution.",
            "Created detailed documentation, including API references, system diagrams, and changelogs for long-term maintainability."
        ],
        "technologies": [
            "HTML, CSS, and JavaScript",
            "Angular",
            "Bootstrapping",
            "Django",
            "Python",
            "T-SQL",
            "RESTful APIs",
            "Git",
            "GitLab",
            "SQL Server",
            "Database Design"
        ],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Problem-solving",
            "Agile workflows",
            "Collaboration"
        ],
        "achievements": [
            "Gained expertise in Python libraries, RESTful API design, full-stack development, and software engineering best practices like testing and scalability."
        ],
        "company_logo": "public/static/logo/boit_logo.png",
        "company_url": "https://blueoceanit.com.my/",
        "highlight": true
    },
    {
        "company": "Blue Ocean IT Sdn. Bhd.",
        "position": "Part-time Software Engineer",
        "location": {
            "city": "Kuala Lumpur",
            "country": "Malaysia"
        },
        "type": "Part-time",
        "periods": [
            {
                "start": {
                    "month": "November",
                    "year": 2024
                },
                "end": {
                    "month": "February",
                    "year": 2025
                }
            }
        ],
        "description": "Continued contributing to software development projects on a part-time basis, focusing on backend data processing, scheduling, API integration, and comprehensive debugging.",
        "responsibilities": [
            "Assisted in the research, testing, and integration of external APIs.",
            "Addressed and resolved numerous complex bugs and technical issues across different application components.",
            "Contributed to code management, merging, and ensuring code quality.",
            "Developed and updated backend functionalities related to data handling and process automation.",
            "Provided technical support and guidance to fellow team members.",
            "Worked on database-related issues, including data discrepancies and schema adjustments.",
            "Participated in deployment assistance and system maintenance tasks.",
            "Researched and implemented fixes for security and authentication issues."
        ],
        "technologies": [
            "Git",
            "GitLab",
            "Python",
            "SQL Server",
            "APIs",
            "XML",
            "LDAP",
            "Debugging Tools",
            "Database Tools",
            "Angular",
            "Django",
            "HTML, CSS, and JavaScript"
        ],
        "soft_skills": [
            "Problem-solving",
            "Debugging",
            "Research",
            "Collaboration",
            "Communication",
            "Technical Support",
            "Analytical Thinking"
        ],
        "achievements": [
            "Successfully resolved a wide range of technical issues, enhancing application stability and performance.",
            "Contributed to the successful integration and testing of critical API functionalities.",
            "Supported deployment efforts and assisted colleagues, improving team efficiency."
        ],
        "company_logo": "public/static/logo/boit_logo.png",
        "company_url": "https://blueoceanit.com.my/",
        "highlight": false
    },
    {
        "company": "Blue Ocean IT Sdn. Bhd.",
        "position": "Part-time Software Engineer",
        "location": {
            "city": "Kuala Lumpur",
            "country": "Malaysia"
        },
        "type": "Part-time",
        "periods": [
            {
                "start": {
                    "month": "April",
                    "year": 2025
                },
                "end": {
                    "month": "",
                    "year": ""
                }
            }
        ],
        "description": "Rejoined Blue Ocean IT on a part-time basis, currently contributing to ongoing software development tasks.",
        "responsibilities": [],
        "technologies": [],
        "soft_skills": [],
        "achievements": [],
        "company_logo": "public/static/logo/boit_logo.png",
        "company_url": "https://blueoceanit.com.my/",
        "highlight": false
    }
]