[
    {
        "company": "Blue Ocean IT Sdn. Bhd.",
        "position": "Software Engineer Intern",
        "location": {
            "city": "Kuala Lumpur",
            "country": "Malaysia"
        },
        "periods": [
            {
                "start": {
                    "month": "July",
                    "year": 2024
                },
                "end": {
                    "month": "November",
                    "year": 2024
                }
            }
        ],
        "description": "Software Engineer Internship at Blue Ocean IT, focusing on full-stack development, database management, and improving software engineering practices within an agile environment.",
        "responsibilities": [
            "Developed and maintained dynamic web platforms, ensuring responsive design and user-friendly interfaces.",
            "Implemented and supported backend services and APIs, enabling efficient data handling and system integration.",
            "Optimized relational databases to improve performance, data integrity, and scalability.",
            "Automated task reporting processes to reduce manual effort and improve team efficiency.",
            "Collaborated with team members using version control and code reviews to ensure code quality and resolve conflicts.",
            "Enhanced user access control by implementing secure authentication mechanisms in backend systems.",
            "Developed APIs to provide external users with direct, secure access to application features."
        ],
        "technologies": [
            "Angular",
            "Django",
            "Python",
            "RESTful APIs",
            "Git",
            "GitLab",
            "SQL Server",
            "LDAP",
            "HTML, CSS, JavaScript"
        ],
        "soft_skills": [
            "Communication",
            "Teamwork",
            "Problem-solving",
            "Agile workflows",
            "Collaboration"
        ],
        "achievements": [
            "Reduced page load times by ~90% through AJAX-based data fetching with comprehensive error handling, significantly enhancing user experience.",
            "Utilized HTML, CSS, JavaScript, Angular, and Django to build and maintain web platforms, improving overall usability and performance.",
            "Reduced data fetching time by ~50% and eliminated internal errors through T-SQL query tuning and Django backend optimizations, ensuring stable, high-performance retrieval.",
            "Automated daily reporting tasks for internal employees using Python and GitLab APIs, improving workforce efficiency and reducing manual effort.",
            "Integrated Django authentication with corporate LDAP for centralized user management, automated provisioning, and consistent access control."
        ],
        "summary_achievements": [
            "Reduced page load times by ~90% with AJAX-based data fetching and error handling.",
            "Cut data fetching time by ~50% through T-SQL and backend optimizations.",
            "Automated daily reporting using Python and GitLab APIs.",
            "Integrated Django authentication with corporate LDAP for centralized access control."
        ],
        "company_logo": "/logo/boit_logo.png",
        "company_url": "https://blueoceanit.com.my/",
        "highlight": true
    },
    {
        "company": "Blue Ocean IT Sdn. Bhd.",
        "position": "Part-time Software Engineer",
        "location": {
            "city": "Kuala Lumpur",
            "country": "Malaysia"
        },
        "periods": [
            {
                "start": {
                    "month": "November",
                    "year": 2024
                },
                "end": {
                    "month": "May",
                    "year": 2025
                }
            }
        ],
        "description": "Continued contributing to software development projects on a part-time basis, focusing on backend data processing, scheduling, API integration, and comprehensive debugging.",
        "responsibilities": [
            "Supported research, testing, and integration of third-party APIs to expand application capabilities.",
            "Investigated and resolved complex bugs across multiple application layers, improving system reliability.",
            "Contributed to backend development focused on data processing, automation, and performance optimization.",
            "Resolved data inconsistencies and participated in schema design updates to maintain database accuracy and integrity.",
            "Assisted in application deployment and routine maintenance to ensure smooth system operations.",
            "Identified and addressed security and authentication issues through targeted research and implementation.",
            "Designed and developed backend microservices with inter-service communication to support modular system architecture."
        ],
        "technologies": [
            "RESTful APIs",
            "Git",
            "GitLab",
            "Microservices",
            "SQL Server",
            "APIs",
            "Angular",
            "Django"
        ],
        "soft_skills": [
            "Problem-solving",
            "Debugging",
            "Research",
            "Collaboration",
            "Communication",
            "Technical Support",
            "Analytical Thinking"
        ],
        "achievements": [
            "Improved backend reliability by resolving recurring bugs across Django-based services and ensuring stable API integration.",
            "Reduced system errors and enhanced performance through optimized SQL queries and schema updates in SQL Server.",
            "Improved authentication stability by resolving issues related to external API interactions.",
            "Enhanced backend flexibility and maintainability by developing Python-based microservices with clear inter-service communication.",
            "Enhanced and maintained Angular-based frontend integrated with Django APIs, reducing frontend bugs and enabling the addition of new features for improved functionality.",
            "Developed multiple microservices with token-based authentication, ensuring secure and efficient inter-service communication."
        ],
        "summary_achievements": [
            "Resolved recurring bugs and improved backend reliability across Django services.",
            "Reduced system errors and improved performance with optimized SQL queries.",
            "Enhanced authentication stability for external API interactions.",
            "Developed multiple Python microservices with secure, token-based communication.",
            "Reduced frontend bugs and enabled new features in Angular-Django integration."
        ],
        "company_logo": "/logo/boit_logo.png",
        "company_url": "https://blueoceanit.com.my/",
        "highlight": false
    }
]