[
    {
        "name": "InLancing - AI-Powered Anonymous Freelancing Platform",
        "description": "A comprehensive full-stack freelancing platform that connects clients with skilled developers through intelligent task-based projects. The platform features AI-powered task generation using Google Gemini, real-time communication via WebSockets, secure milestone-based payments, bid management system, integrated Azure DevOps repository management, and comprehensive notification systems. Built with Django REST Framework and Next.js 15, the system demonstrates advanced full-stack development capabilities with AI integration.",
        "achievements": [
            "Designed and developed a complete full-stack freelancing platform with separate frontend and backend services.",
            "Implemented AI-powered task form generation using Google Gemini 2.5 Flash API to streamline project creation and improve user experience.",
            "Built robust real-time bidirectional chat functionality using Django Channels and WebSockets.",
            "Integrated Azure DevOps Git repository management system including automated branch creation, commit tracking, file management, and repository downloads.",
            "Designed and implemented secure milestone-based payment system with multi-stage approval workflows and comprehensive status tracking.",
            "Created sophisticated role-based access control system with distinct Client and Freelancer user roles, permissions, and dashboard interfaces.",
            "Achieved containerized application deployment using Docker with Azure Container Registry integration and orchestration setup.",
            "Built comprehensive email notification system utilizing Django Templates.",
            "Developed sophisticated task management system with bidding workflows, acceptance processes, quality reviews, and milestone tracking",
            "Created responsive, accessible frontend interface using Next.js 15 with TypeScript, React 19, and Tailwind CSS 4 following modern UI/UX principles."
        ],
        "summary_achievements": [
            "Built a full-stack freelancing platform with AI-powered task generation (Google Gemini 2.5), real-time WebSocket chat, and Azure DevOps repository management.",
            "Implemented milestone-based payment system with multi-stage workflows, bid management, and role-based access control for Clients and Freelancers.",
            "Developed comprehensive task management system with bidding workflows, acceptance processes, quality reviews, and automated email notifications.",
            "Achieved containerized deployment with Docker and Azure Container Registry, demonstrating enterprise-grade system design and API integration."
        ],
        "year": "2024-2025",
        "duration": "6 months",
        "link": "",
        "soft_skills_utilized": [
            "System Design",
            "Problem Solving",
            "Project Management",
            "Technical Documentation",
            "Research & Analysis",
            "Critical Thinking",
            "Time Management",
            "Adaptability",
            "Communication",
            "Attention to Detail"
        ],
        "hard_skills_utilized": [
            "Python",
            "Django (REST Framework, Channels, Templates)",
            "TypeScript",
            "Next.js & React",
            "PostgreSQL",
            "Docker",
            "Azure (Container Registry, DevOps API)",
            "AI Integration (Google Gemini API)",
            "RESTful APIs & WebSocket Communication",
            "Git Version Control",
            "Tailwind CSS",
            "Authentication & Authorization (JWT, RBAC)",
            "UI/UX Design"
        ],
        "images": [],
        "in_resume": true
    },
    {
        "name": "Portfolio Website",
        "description": "A dynamic and responsive personal website built with SvelteKit and Tailwind CSS to showcase skills, projects, and professional experience. Features seamless light/dark theme switching and engaging animations.",
        "achievements": [
            "Developed a fully responsive portfolio website using SvelteKit and Tailwind CSS, ensuring optimal viewing across devices and clean, utility-first styling.",
            "Implemented modular and reusable Svelte components along with smooth scrolling and scroll-triggered animations using Intersection Observer to enhance user experience and maintainability.",
            "Integrated dynamic light/dark theme switching with Mode Watcher to support accessibility and user preferences.",
            "Deployed the application via Vercel for continuous integration and streamlined delivery workflows.",
            "Created a custom resume generator using Typst, with both portfolio and resume powered by a shared JSON data source for easier updates and consistent presentation."
        ],
        "summary_achievements": [
            "Built a responsive portfolio website with SvelteKit and Tailwind CSS.",
            "Implemented modular components, smooth animations, and theme switching.",
            "Created a Typst-based resume generator using shared JSON data."
        ],
        "year": "2024",
        "duration": "",
        "link": "https://github.com/WilbCorn/portfolio-web",
        "soft_skills_utilized": [
            "Project Management",
            "UI/UX Design",
            "Problem-solving",
            "Self-learning",
            "Attention to Detail"
        ],
        "hard_skills_utilized": [
            "SvelteKit",
            "TypeScript",
            "Tailwind CSS",
            "Mode Watcher",
            "Vite",
            "HTML, CSS",
            "Git",
            "Intersection Observer API",
            "Typst",
            "Vercel"
        ],
        "images": [],
        "in_resume": true
    },
    {
        "name": "doc2pdf",
        "description": "A cross-platform Python-based tool that converts Microsoft Office documents to PDF using LibreOffice. It supports individual files, directories, and ZIP archives, maintaining directory structure in output and offering CLI options for flexibility. The tool optionally copies non-convertible files and supports multithreaded processing for improved performance.",
        "achievements": [
            "Developed a versatile document conversion tool using Python on Linux, capable of handling multiple file formats including .ppt, .pptx, .doc, .docx, .xls, and .xlsx.",
            "Implemented functionality to process files from various sources: individual files, directory trees with subdirectories, and ZIP archives.",
            "Ensured preservation of original directory structures in the output, enhancing organization and user experience.",
            "Integrated optional multithreading to improve performance during batch conversions, with configurable thread limits.",
            "Provided flexible configuration through a centralized settings module, allowing users to customize behavior such as file copying and exclusion rules.",
            "Designed a modular architecture promoting maintainability and scalability, separating concerns into distinct modules (e.g., converters, file utils, conversion logic).",
            "Created both CLI and GUI interfaces, expanding accessibility and usability for different types of users.",
            "Built and deployed a Docker image to enable usage without requiring local installation of Python or LibreOffice."
        ],
        "summary_achievements": [
            "Created a Linux-based Python tool for converting various document formats to PDF while preserving input structure.",
            "Implemented support for processing files from multiple sources including directories and ZIP archives.",
            "Offered both CLI and GUI interfaces, along with a Docker image option, to enhance accessibility."
        ],
        "year": "2025",
        "duration": "",
        "link": "https://github.com/WilbCorn/doc2pdf",
        "soft_skills_utilized": [
            "Problem-Solving",
            "Attention to Detail",
            "Adaptability",
            "User-Centered Design",
            "Documentation"
        ],
        "hard_skills_utilized": [
            "Python",
            "Linux",
            "File Handling and Processing",
            "LibreOffice Integration",
            "Multithreading",
            "Streamlit",
            "Docker",
            "Configuration Management"
        ],
        "images": [],
        "in_resume": true
    },
    {
        "name": "Knit",
        "description": "Knit is a Flutter-based mobile application designed to foster community engagement and reduce social isolation by enabling residents to connect, chat, and organize neighborhood events easily.",
        "achievements": [
            "Achieved A+ (4.0) in Mobile App Engineering module for the development of Knit app.",
            "Developed a fully functional Flutter app with a modular codebase.",
            "Implemented features for neighbor interaction, event organization, and onboarding of new residents.",
            "Collaborated in a team setting to ideate and deliver a community-focused mobile solution."
        ],
        "summary_achievements": [
            "Achieved A+ (4.0) in Mobile App Engineering module.",
            "Enabled real-time neighbor interaction and local event organization.",
            "Collaborated effectively in a team to deliver a polished mobile experience."
        ],
        "year": "2023",
        "duration": "",
        "link": "",
        "soft_skills_utilized": [
            "Team collaboration",
            "Problem-solving",
            "User empathy",
            "Communication"
        ],
        "hard_skills_utilized": [
            "Flutter",
            "Dart",
            "UI/UX Design",
            "Firebase",
            "Mobile App Development"
        ],
        "images": [],
        "in_resume": false
    },
    {
        "name": "J.I.M",
        "description": "Fitness-Oriented Chatbot designed to assist users in selecting appropriate exercises, warm-ups, and providing health-related information.",
        "achievements": [
            "Contributed in achieving A+ (4.0) in Introduction to Artificial Intelligence module.",
            "Achieved a 94.4% success rate in providing users with helpful and relevant information.",
            "Assisted users in selecting exercises and warm-ups to target specific muscle groups.",
            "Responded to health-related inquiries with accurate and reliable information."
        ],
        "summary_achievements": [
            "Achieved a A+ (4.0) in Introduction to Artificial Intelligence.",
            "Developed a chatbot to assist users with exercise and health queries.",
            "Achieved a 94.4% success rate in providing relevant information."
        ],
        "year": "2023",
        "duration": "",
        "link": "",
        "soft_skills_utilized": [
            "Problem-solving",
            "Communication",
            "Teamwork"
        ],
        "hard_skills_utilized": [
            "Google Dialogflow",
            "Knowledge Base Creation",
            "Artificial Intelligence"
        ],
        "images": [],
        "in_resume": false
    },
    {
        "name": "APU Programming Cafe",
        "description": "Coaching Class Application for Programming that includes user registration, deletion, and SQL database management.",
        "achievements": [
            "Achieved A (3.7) in the Introduction to Object-Oriented Programming module using C#.",
            "Designed and implemented the Administrator role, including user registration and deletion features for efficient user management.",
            "Designed and optimized SQL database schemas, and implemented queries for effective data retrieval and manipulation."
        ],
        "summary_achievements": [
            "Achieved A (3.7) in Object-Oriented Programming using C#.",
            "Developed admin features for user management.",
            "Designed and optimized SQL database schemas."
        ],
        "year": "2023",
        "duration": "",
        "link": "",
        "soft_skills_utilized": [
            "Collaboration",
            "Problem-solving",
            "Time Management"
        ],
        "hard_skills_utilized": [
            "C# Programming",
            "SQL Database Design",
            "Object-Oriented Programming"
        ],
        "images": [],
        "in_resume": false
    },
    {
        "name": "Food Ordering System",
        "description": "An online food ordering system that allows customers to browse and place orders for various food types through multiple vendors.",
        "achievements": [
            "Achieved A (3.7) in Object-Oriented Development with Java module.",
            "Developed an online food ordering system with features such as user registration, order tracking, and notification integration.",
            "Utilized text files for lightweight data storage.",
            "Collaborated effectively in a team environment using Git and GitHub for version control and code management."
        ],
        "summary_achievements": [
            "Achieved A (3.7) in Object-Oriented Development with Java.",
            "Developed an online food ordering system with user and order management."
        ],
        "year": "2023",
        "duration": "",
        "link": "",
        "soft_skills_utilized": [
            "Teamwork",
            "Adaptability",
            "Communication"
        ],
        "hard_skills_utilized": [
            "Java Programming",
            "GitHub/Git Version Control",
            "Text File Data Management"
        ],
        "images": [],
        "in_resume": false
    }
]